const FORMATIONS = {
  '4-3-3 DM': [
    ['GK','门将','GK'],['LB','左后卫','FB'],['LCB','左中卫','CB'],['RCB','右中卫','CB'],['RB','右后卫','FB'],
    ['DM','后腰','DM'],['LCM','左中场','CM'],['RCM','右中场','CM'],['LW','左边锋','W'],['RW','右边锋','W'],['ST','中锋','ST']
  ],
  '4-2-3-1': [
    ['GK','门将','GK'],['LB','左后卫','FB'],['LCB','左中卫','CB'],['RCB','右中卫','CB'],['RB','右后卫','FB'],
    ['LCM','左中场','CM'],['RCM','右中场','CM'],['LW','左边锋','W'],['AM','前腰','AM'],['RW','右边锋','W'],['ST','中锋','ST']
  ],
  '4-4-2': [
    ['GK','门将','GK'],['LB','左后卫','FB'],['LCB','左中卫','CB'],['RCB','右中卫','CB'],['RB','右后卫','FB'],
    ['LM','左前卫','W'],['LCM','左中场','CM'],['RCM','右中场','CM'],['RM','右前卫','W'],['LST','左前锋','ST'],['RST','右前锋','ST']
  ],
  '3-4-2-1': [
    ['GK','门将','GK'],['LCB','左中卫','CB'],['CB','中卫','CB'],['RCB','右中卫','CB'],['LWB','左翼卫','FB'],['LCM','左中场','CM'],['RCM','右中场','CM'],['RWB','右翼卫','FB'],['LAM','左前腰','AM'],['RAM','右前腰','AM'],['ST','中锋','ST']
  ]
};

const IN_POSSESSION_ROLES = {
  GK:['门线门将','出球门将','自由人门将'],
  FB:['边后卫','进攻型边后卫','内收边后卫','组织型边后卫'],
  CB:['中后卫','出球中卫','拖后中卫','前压中卫'],
  DM:['防守型中场','拖后组织核心','后腰组织者','节拍器'],
  CM:['中前卫','全能中场','中场组织核心','肋部中场'],
  AM:['前腰','高级组织核心','影子前锋','自由攻击手'],
  W:['边锋','内切边锋','边路组织者','宽位前锋'],
  ST:['突前前锋','全能前锋','站桩中锋','回撤前锋','穿插前锋']
};

const OUT_POSSESSION_ROLES = {
  GK:['门线保护','积极出击'],
  FB:['防守边卫','压迫边卫','收缩边卫'],
  CB:['盯人中卫','协防中卫','前压中卫'],
  DM:['屏障后腰','压迫后腰','盯人后腰'],
  CM:['中场屏障','高位逼抢','回撤中场'],
  AM:['前场压迫','封锁后腰','回撤中场'],
  W:['回防边锋','高位逼抢','内收封锁'],
  ST:['逼抢前锋','封堵出球','回撤防守']
};

module.exports = {
  PORT: Number(process.env.PORT || 3000),
  TEAM_COUNT: 20,
  SQUAD_SIZE: 18,
  STARTERS: 11,
  DRAFT_MODE: 'snake',
  HOME_ADVANTAGE: 0.18,
  RANDOMNESS: 0.8,
  FORMATIONS,
  IN_POSSESSION_ROLES,
  OUT_POSSESSION_ROLES,
  MENTALITIES: ['谨慎','平衡','积极','进攻']
};
